tiiuae/contiki-ng/arch/cpu/gecko2/radio/efr32-radio-IEEE802154_GB915MHz.c
  /* skip length byte */
  packet_info.firstPortionData++;
  packet_info.firstPortionBytes--;
  packet_info.packetBytes--;

  /* Skip one more length byte, SUN_FSK */
  packet_info.firstPortionData++;
  packet_info.firstPortionBytes--;
  packet_info.packetBytes--;

  rx_buf = get_empty_rx_buf();
  if(rx_buf != NULL) {
    rx_buf->len = length;

    /* read packet into buffer */
    memcpy(rx_buf->buf, packet_info.firstPortionData,
           packet_info.firstPortionBytes);
    if(packet_info.lastPortionData != NULL) {
      memcpy(rx_buf->buf + packet_info.firstPortionBytes,
             packet_info.lastPortionData,
             packet_info.packetBytes - packet_info.firstPortionBytes);
    }
    rx_buf->rssi = packet_details.rssi;
    rx_buf->lqi = packet_details.lqi;
    rx_buf->timestamp = packet_details.timeReceived.packetTime;
  } else {
    LOG_INFO("EFR32 Radio: Could not allocate rx_buf\n");
  }

  /* After the copy of the packet, the RX packet can be release for RAIL */
  rail_status = RAIL_ReleaseRxPacket(sRailHandle, rx_packet_handle);
  if(rail_status != RAIL_STATUS_NO_ERROR) {
    LOG_WARN("RAIL_ReleaseRxPacket() result:%d\n", rail_status);
  }
}
/*---------------------------------------------------------------------------*/
static void
rail_events_cb(RAIL_Handle_t rail_handle, RAIL_Events_t events)
{
  if(events & (RAIL_EVENT_TX_ABORTED | RAIL_EVENT_TX_BLOCKED | RAIL_EVENT_TX_UNDERFLOW)) {
    tx_status = TX_ERROR;
  }

  if(events & RAIL_EVENT_RX_ACK_TIMEOUT) {
    tx_status = TX_NO_ACK;
  }

  if(events & (RAIL_EVENT_RX_FIFO_OVERFLOW
               | RAIL_EVENT_RX_ADDRESS_FILTERED
               | RAIL_EVENT_RX_PACKET_ABORTED
               | RAIL_EVENT_RX_FRAME_ERROR
               | RAIL_EVENT_RX_PACKET_RECEIVED)) {
    is_receiving = false;
    if(events & RAIL_EVENT_RX_PACKET_RECEIVED) {
      RAIL_HoldRxPacket(rail_handle);
      if(!poll_mode) {
        LOG_INFO("EFR32 Radio: Receive event - poll.\n");
        process_poll(&efr32_radio_process_915);
      }
    }
  }

  if(events & RAIL_EVENT_TX_PACKET_SENT) {
    LOG_INFO("EFR32 Radio: packet sent.\n");
    tx_status = TX_SENT;
  }

  if(events & RAIL_EVENT_TX_CHANNEL_BUSY) {
    tx_status = TX_CHANNEL_BUSY;
  }

  if(events & (RAIL_EVENT_RX_SYNC1_DETECT | RAIL_EVENT_RX_SYNC2_DETECT)) {
    is_receiving = true;
  }

  if(events & RAIL_EVENT_CAL_NEEDED) {
    (void)RAIL_Calibrate(rail_handle, NULL, RAIL_CAL_ALL_PENDING);
  }
}
/*---------------------------------------------------------------------------*/
static int
init(void)
{
  RAIL_Status_t status;
  uint8_t *ext_addr;
  uint16_t short_addr;
  uint16_t allocated_tx_fifo_size;
  uint64_t system_number;

  NVIC_SetPriority(FRC_PRI_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(FRC_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(MODEM_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(RAC_SEQ_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(RAC_RSM_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(BUFC_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(AGC_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(PROTIMER_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(SYNTH_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  
  sl_rail_util_dma_init();
  sl_rail_util_pa_init();
  sl_rail_util_pti_init();
  sl_rail_util_rf_path_switch_init();
  sl_rail_util_rf_path_init();
  sl_rail_util_rssi_init();

  /* Initializes the RAIL core. */
  sRailHandle = RAIL_Init(&rail_config, NULL);
  if(sRailHandle == NULL) {
    LOG_ERR("RAIL_Init failed, return value: NULL\n");
    return 0;
  }

  status = RAIL_InitPowerManager();
  if(status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("RAIL_InitPowerManager failed, return value: %d\n", status);
    return 0;
  }

  status = RAIL_ConfigData(sRailHandle, &data_config);

  if(status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("RAIL_ConfigData failed, return value: %d\n", status);
    return 0;
  }

  /* Configures the channels. */
  (void)RAIL_ConfigChannels(sRailHandle,
                            RAIL_IEEE802154_PhyGB915MHz,
                            &sl_rail_util_pa_on_channel_config_change);

  status = RAIL_IEEE802154_Init(sRailHandle, &rail_ieee802154_config);
  if(status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("RAIL_IEEE802154_Init failed, return value: %d\n", status);
    return 0;
  }

 
 /*
 * This call implicitly enables RAIL_IEEE802154_G_OPTION_GB868
 */ 
  status = RAIL_IEEE802154_ConfigGB915MHzRadio(sRailHandle);
  if(status != RAIL_STATUS_NO_ERROR) {
    (void)RAIL_IEEE802154_Deinit(sRailHandle);
    LOG_ERR("RAIL_IEEE802154_ConfigGB915Radio failed, return value: %d\n", status);
    return 0;
  } 

  status = RAIL_IEEE802154_ConfigEOptions(sRailHandle,
                                          (RAIL_IEEE802154_E_OPTION_GB868
                                           | RAIL_IEEE802154_E_OPTION_ENH_ACK
                                           | RAIL_IEEE802154_E_OPTION_IMPLICIT_BROADCAST),
                                          (RAIL_IEEE802154_E_OPTION_GB868
                                           | RAIL_IEEE802154_E_OPTION_ENH_ACK
                                           | RAIL_IEEE802154_E_OPTION_IMPLICIT_BROADCAST));

  if(status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("RAIL_IEEE802154_ConfigEOptions failed, return value: %d\n", status);
    return 0;
  }

  /* Initialize RAIL calibration. */
  status = RAIL_ConfigCal(sRailHandle,
                          0U
                          | (0
                             ? RAIL_CAL_TEMP : 0U)
                          | (0
                             ? RAIL_CAL_ONETIME : 0U));
  if(status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("RAIL_ConfigCal failed, return value: %d\n", status);
    return 0;
  }

  /* Config events. */
  if(!configure_radio_interrupts()) {
    return 0;
  }

  system_number = SYSTEM_GetUnique();

  ext_addr = (uint8_t *)&system_number;
  short_addr = ext_addr[7];
  short_addr |= ext_addr[6] << 8;

